org-data/all_results.org
#+ATTR_ORG: :wrap t

* RQ1

| Project <> Test                                        | Warp-found dependencies                                            | Required Depenencies                                                       | Accuracy |
|--------------------------------------------------------+--------------------------------------------------------------------+----------------------------------------------------------------------------+----------|
| cargo <> over_the_limit                                | [ "LimitErrorReader", "Vec", "over_the_limit" ]                    | [ "LimitErrorReader", "Vec", "over_the_limit" ]                            |     100% |
| cargo <> under_the_limit                               | [ "LimitErrorReader", "Vec", "core", "under_the_limit" ]           | [ "LimitErrorReader", "Vec", "core", "under_the_limit" ]                   |     100% |
| embedded_hal <> cmp_id                                 | [ "ExtendedId", "Id", "StandardId", "cmp_id", "core" ]             | [ "ExtendedId", "Id", "StandardId", "cmp_id", "core" ]                     |     100% |
| embedded_hal <> extended_id_new_out_of_range           | [ "ExtendedId", "core", "extended_id_new_out_of_range" ]           | [ "ExtendedId", "core", "extended_id_new_out_of_range" ]                   |     100% |
| embedded_hal <> extended_id_new_unchecked_out_of_range | [ "ExtendedId", "core", "extended_id_new_unchecked_out_of_range" ] | [ "ExtendedId", "core", "extended_id_new_unchecked_out_of_range" ]         |     100% |
| embedded_hal <> get_standard_id_from_extended_id       | [ "StandardId", "core", "get_standard_id_from_extended_id" ]       | [ "StandardId", "ExtendedId", "core", "get_standard_id_from_extended_id" ] |      75% |
| embedded_hal <> standard_id_new_out_of_range           | [ "StandardId", "core", "standard_id_new_out_of_range" ]           | [ "StandardId", "core", "standard_id_new_out_of_range" ]                   |     100% |
| embedded_hal <> standard_id_new_unchecked_out_of_range | [ "StandardId", "core", "standard_id_new_unchecked_out_of_range" ] | [ "StandardId", "core", "standard_id_new_unchecked_out_of_range" ]         |     100% |
| rust_cmd_lib <> test_proc_var_map                      | [ "HashMap", "MAP", "core", "std", "test_proc_var_map" ]           | [ "HashMap", "MAP", "core", "std", "test_proc_var_map" ]                   |     100% |
| rust_cmd_lib <> test_proc_var_u32                      | [ "LEN", "core", "std", "test_proc_var_u32" ]                      | [ "LEN", "core", "std", "test_proc_var_u32" ]                              |     100% |
| rust_cmd_lib <> test_proc_var_vec                      | [ "V", "alloc", "core", "std", "test_proc_var_vec" ]               | [ "V", "alloc", "core", "std", "test_proc_var_vec" ]                       |     100% |
| rust_ansi_term <> colour_deserialization               | [ "Colour", "colour_deserialization", "serde_json" ]               | [ "Colour", "colour_deserialization", "serde_json" ]                       |     100% |
| rust_ansi_term <> style_serialization                  | [ "Style", "style_serialization" ]                                 | [ "serde_json", "Style", "style_serialization" ]                           |    66.6% |
| rust_ansi_term <> colour_serialization                 | [ "Color", "colour_serialization" ]                                | [ "serde_json", "Color", "colour_serialization" ]                          |    66.6% |

* RQ2
** Comment

| Project <> Test                                        | Warp         | Cargo             |             |
|                                                        | Mean [ms]    | Mean [ms]         | Ratio       |
|--------------------------------------------------------+--------------+-------------------+-------------|
| cargo <> over_the_limit                                | 141.2 ± 26.6 | 252.4 ± 16.1273.4 | 1.79 ± 0.36 |
| cargo <> under_the_limit                               | 142.0 ± 7.5  | 246.7 ± 6.7       | 1.74 ± 0.10 |
| embedded_hal <> cmp_id                                 | 262.6 ± 26.1 | 309.0 ± 18.1      | 1.18 ± 0.14 |
| embedded_hal <> extended_id_new_out_of_range           | 266.0 ± 15.8 | 309.7 ± 17.2      | 1.16 ± 0.09 |
| embedded_hal <> extended_id_new_unchecked_out_of_range | 281.6 ± 32.0 | 307.5 ± 19.1      | 1.09 ± 0.14 |
| embedded_hal <> get_standard_id_from_extended_id       | 273.3 ± 24.3 | 309.1 ± 16.2      | 1.13 ± 0.12 |
| embedded_hal <> standard_id_new_out_of_range           | 269.5 ± 21.9 | 311.4 ± 21.0      | 1.16 ± 0.12 |
| embedded_hal <> standard_id_new_unchecked_out_of_range | 282.1 ± 27.9 | 305.0 ± 17.3      | 1.08 ± 0.12 |
| rust_cmd_lib <> test_proc_var_map                      | 295.8 ± 44.0 | 807.8 ± 48.5      | 2.73 ± 0.44 |
| rust_cmd_lib <> test_proc_var_u32                      | 285.2 ± 41.7 | 805.4 ± 36.2      | 2.82 ± 0.43 |
| rust_cmd_lib <> test_proc_var_vec                      | 303.4 ± 40.6 | 802.3 ± 21.9      | 2.64 ± 0.36 |
| rust_ansi_term <> colour_deserialization               | 189.3 ± 19.8 | 487.0 ± 11.3      | 2.57 ± 0.28 |
| rust_ansi_term <> style_serialization                  | 278.0 ± 40.8 | 486.7 ± 15.0      | 1.75 ± 0.26 |
| rust_ansi_term <> colour_serialization                 | 191.8 ± 16.0 | 483.7 ± 14.1      | 2.52 ± 0.22 |

** Modify function

| Project <> Test                                        | Warp         | Cargo           |               |
|                                                        | Mean [ms]    | Mean [ms]       | Ratio         |
|--------------------------------------------------------+--------------+-----------------+---------------|
| cargo <> over_the_limit                                | 124.7 ± 4.1  | 9308.6 ± 1141.4 | 74.66 ± 9.48  |
| cargo <> under_the_limit                               | 231.1 ± 60.7 | 8594.8 ± 616.0  | 37.19 ± 10.12 |
| embedded_hal <> cmp_id                                 | 259.4 ± 3.6  | 528.6 ± 99.4    | 2.04 ± 0.38   |
| embedded_hal <> extended_id_new_out_of_range           | 257.0 ± 5.0  | 520.9 ± 101.5   | 2.03 ± 0.40   |
| embedded_hal <> extended_id_new_unchecked_out_of_range | 258.3 ± 3.8  | 387.3 ± 83.1    | 1.50 ± 0.32   |
| embedded_hal <> get_standard_id_from_extended_id       | 261.8 ± 4.5  | 518.2 ± 88.0    | 1.98 ± 0.34   |
| embedded_hal <> standard_id_new_out_of_range           | 467.7 ± 11.7 | 1127.5 ± 373.8  | 2.41 ± 0.80   |
| embedded_hal <> standard_id_new_unchecked_out_of_range | 472.4 ± 11.0 | 533.3 ± 115.2   | 1.13 ± 0.25   |
| rust_cmd_lib <> test_proc_var_map                      | 207.3 ± 12.0 | 1720.3 ± 224.7  | 8.30 ± 1.19   |
| rust_cmd_lib <> test_proc_var_u32                      | 331.0 ± 19.5 | 1698.3 ± 220.0  | 5.13 ± 0.73   |
| rust_cmd_lib <> test_proc_var_vec                      | 203.9 ± 19.5 | 1083.8 ± 148.4  | 5.31 ± 0.89   |
| rust_ansi_term <> colour_deserialization               | 456.2 ± 4.1  | 1634.7 ± 413.0  | 3.58 ± 0.91   |
| rust_ansi_term <> style_serialization                  | 456.5 ± 4.8  | 1588.3 ± 394.3  | 3.48 ± 0.86   |
| rust_ansi_term <> colour_serialization                 | 458.5 ± 4.3  | 1539.8 ± 301.5  | 3.36 ± 0.66   |

** New function

| Project <> Test                                        | Warp         | Cargo          |              |
|                                                        | Mean [ms]    | Mean [ms]      | Ratio        |
|--------------------------------------------------------+--------------+----------------+--------------|
| cargo <> over_the_limit                                | 187.5 ± 6.0  | 8050.0 ± 311.0 | 42.94 ± 2.15 |
| cargo <> under_the_limit                               | 211.9 ± 6.0  | 8042.9 ± 267.3 | 37.95 ± 1.65 |
| embedded_hal <> cmp_id                                 | 468.9 ± 8.4  | 368.6 ± 70.3   | 0.78 ± 0.24  |
| embedded_hal <> extended_id_new_out_of_range           | 463.8 ± 11.7 | 388.0 ± 84.1   | 0.83 ± 0.26  |
| embedded_hal <> extended_id_new_unchecked_out_of_range | 465.9 ± 6.1  | 388.7 ± 88.7   | 0.83 ± 0.27  |
| embedded_hal <> get_standard_id_from_extended_id       | 466.0 ± 5.8  | 375.5 ± 70.6   | 0.80 ± 0.23  |
| embedded_hal <> standard_id_new_out_of_range           | 465.4 ± 5.3  | 372.9 ± 68.9   | 0.80 ± 0.23  |
| embedded_hal <> standard_id_new_unchecked_out_of_range | 468.9 ± 6.9  | 393.0 ± 76.5   | 0.84 ± 0.23  |
| rust_cmd_lib <> test_proc_var_map                      | 338.2 ± 6.6  | 938.2 ± 111.3  | 2.77 ± 0.33  |
| rust_cmd_lib <> test_proc_var_u32                      | 550.7 ± 8.1  | 934.0 ± 124.5  | 1.70 ± 0.23  |
| rust_cmd_lib <> test_proc_var_vec                      | 333.0 ± 5.7  | 933.5 ± 122.7  | 2.80 ± 0.37  |
| rust_ansi_term <> colour_deserialization               | 462.1 ± 7.9  | 517.4 ± 50.4   | 1.12 ± 0.11  |
| rust_ansi_term <> style_serialization                  | 462.0 ± 6.8  | 515.6 ± 45.7   | 1.12 ± 0.10  |
| rust_ansi_term <> colour_serialization                 | 459.9 ± 7.8  | 518.4 ± 42.4   | 1.13 ± 0.09  |
