org-data/all_results.tex
% Created 2023-05-08 Mon 23:33
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Calin Capitanu}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={Calin Capitanu},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.2 (Org mode 9.5.5)}, 
 pdflang={English}}
\begin{document}

\tableofcontents


\section{RQ1}
\label{sec:org268a741}

\begin{center}
\begin{tabular}{llll}
Project <> Test & Warp-found dependencies & Required Depenencies & Accuracy\\
\hline
cargo <> over\textsubscript{the}\textsubscript{limit} & [ "LimitErrorReader", "Vec", "over\textsubscript{the}\textsubscript{limit}" ] & [ "LimitErrorReader", "Vec", "over\textsubscript{the}\textsubscript{limit}" ] & 100\%\\
cargo <> under\textsubscript{the}\textsubscript{limit} & [ "LimitErrorReader", "Vec", "core", "under\textsubscript{the}\textsubscript{limit}" ] & [ "LimitErrorReader", "Vec", "core", "under\textsubscript{the}\textsubscript{limit}" ] & 100\%\\
embedded\textsubscript{hal} <> cmp\textsubscript{id} & [ "ExtendedId", "Id", "StandardId", "cmp\textsubscript{id}", "core" ] & [ "ExtendedId", "Id", "StandardId", "cmp\textsubscript{id}", "core" ] & 100\%\\
embedded\textsubscript{hal} <> extended\textsubscript{id}\textsubscript{new}\textsubscript{out}\textsubscript{of}\textsubscript{range} & [ "ExtendedId", "core", "extended\textsubscript{id}\textsubscript{new}\textsubscript{out}\textsubscript{of}\textsubscript{range}" ] & [ "ExtendedId", "core", "extended\textsubscript{id}\textsubscript{new}\textsubscript{out}\textsubscript{of}\textsubscript{range}" ] & 100\%\\
embedded\textsubscript{hal} <> extended\textsubscript{id}\textsubscript{new}\textsubscript{unchecked}\textsubscript{out}\textsubscript{of}\textsubscript{range} & [ "ExtendedId", "core", "extended\textsubscript{id}\textsubscript{new}\textsubscript{unchecked}\textsubscript{out}\textsubscript{of}\textsubscript{range}" ] & [ "ExtendedId", "core", "extended\textsubscript{id}\textsubscript{new}\textsubscript{unchecked}\textsubscript{out}\textsubscript{of}\textsubscript{range}" ] & 100\%\\
embedded\textsubscript{hal} <> get\textsubscript{standard}\textsubscript{id}\textsubscript{from}\textsubscript{extended}\textsubscript{id} & [ "StandardId", "core", "get\textsubscript{standard}\textsubscript{id}\textsubscript{from}\textsubscript{extended}\textsubscript{id}" ] & [ "StandardId", "ExtendedId", "core", "get\textsubscript{standard}\textsubscript{id}\textsubscript{from}\textsubscript{extended}\textsubscript{id}" ] & 75\%\\
embedded\textsubscript{hal} <> standard\textsubscript{id}\textsubscript{new}\textsubscript{out}\textsubscript{of}\textsubscript{range} & [ "StandardId", "core", "standard\textsubscript{id}\textsubscript{new}\textsubscript{out}\textsubscript{of}\textsubscript{range}" ] & [ "StandardId", "core", "standard\textsubscript{id}\textsubscript{new}\textsubscript{out}\textsubscript{of}\textsubscript{range}" ] & 100\%\\
embedded\textsubscript{hal} <> standard\textsubscript{id}\textsubscript{new}\textsubscript{unchecked}\textsubscript{out}\textsubscript{of}\textsubscript{range} & [ "StandardId", "core", "standard\textsubscript{id}\textsubscript{new}\textsubscript{unchecked}\textsubscript{out}\textsubscript{of}\textsubscript{range}" ] & [ "StandardId", "core", "standard\textsubscript{id}\textsubscript{new}\textsubscript{unchecked}\textsubscript{out}\textsubscript{of}\textsubscript{range}" ] & 100\%\\
rust\textsubscript{cmd}\textsubscript{lib} <> test\textsubscript{proc}\textsubscript{var}\textsubscript{map} & [ "HashMap", "MAP", "core", "std", "test\textsubscript{proc}\textsubscript{var}\textsubscript{map}" ] & [ "HashMap", "MAP", "core", "std", "test\textsubscript{proc}\textsubscript{var}\textsubscript{map}" ] & 100\%\\
rust\textsubscript{cmd}\textsubscript{lib} <> test\textsubscript{proc}\textsubscript{var}\textsubscript{u32} & [ "LEN", "core", "std", "test\textsubscript{proc}\textsubscript{var}\textsubscript{u32}" ] & [ "LEN", "core", "std", "test\textsubscript{proc}\textsubscript{var}\textsubscript{u32}" ] & 100\%\\
rust\textsubscript{cmd}\textsubscript{lib} <> test\textsubscript{proc}\textsubscript{var}\textsubscript{vec} & [ "V", "alloc", "core", "std", "test\textsubscript{proc}\textsubscript{var}\textsubscript{vec}" ] & [ "V", "alloc", "core", "std", "test\textsubscript{proc}\textsubscript{var}\textsubscript{vec}" ] & 100\%\\
rust\textsubscript{ansi}\textsubscript{term} <> colour\textsubscript{deserialization} & [ "Colour", "colour\textsubscript{deserialization}", "serde\textsubscript{json}" ] & [ "Colour", "colour\textsubscript{deserialization}", "serde\textsubscript{json}" ] & 100\%\\
rust\textsubscript{ansi}\textsubscript{term} <> style\textsubscript{serialization} & [ "Style", "style\textsubscript{serialization}" ] & [ "serde\textsubscript{json}", "Style", "style\textsubscript{serialization}" ] & 66.6\%\\
rust\textsubscript{ansi}\textsubscript{term} <> colour\textsubscript{serialization} & [ "Color", "colour\textsubscript{serialization}" ] & [ "serde\textsubscript{json}", "Color", "colour\textsubscript{serialization}" ] & 66.6\%\\
\end{tabular}
\end{center}

\section{RQ2}
\label{sec:org033cd2f}
\subsection{Comment}
\label{sec:orgca42fee}

\begin{center}
\begin{tabular}{llll}
Project <> Test & Warp & Cargo & \\
 & Mean [ms] & Mean [ms] & Ratio\\
\hline
cargo <> over\textsubscript{the}\textsubscript{limit} & 141.2 ± 26.6 & 252.4 ± 16.1273.4 & 1.79 ± 0.36\\
cargo <> under\textsubscript{the}\textsubscript{limit} & 142.0 ± 7.5 & 246.7 ± 6.7 & 1.74 ± 0.10\\
embedded\textsubscript{hal} <> cmp\textsubscript{id} & 262.6 ± 26.1 & 309.0 ± 18.1 & 1.18 ± 0.14\\
embedded\textsubscript{hal} <> extended\textsubscript{id}\textsubscript{new}\textsubscript{out}\textsubscript{of}\textsubscript{range} & 266.0 ± 15.8 & 309.7 ± 17.2 & 1.16 ± 0.09\\
embedded\textsubscript{hal} <> extended\textsubscript{id}\textsubscript{new}\textsubscript{unchecked}\textsubscript{out}\textsubscript{of}\textsubscript{range} & 281.6 ± 32.0 & 307.5 ± 19.1 & 1.09 ± 0.14\\
embedded\textsubscript{hal} <> get\textsubscript{standard}\textsubscript{id}\textsubscript{from}\textsubscript{extended}\textsubscript{id} & 273.3 ± 24.3 & 309.1 ± 16.2 & 1.13 ± 0.12\\
embedded\textsubscript{hal} <> standard\textsubscript{id}\textsubscript{new}\textsubscript{out}\textsubscript{of}\textsubscript{range} & 269.5 ± 21.9 & 311.4 ± 21.0 & 1.16 ± 0.12\\
embedded\textsubscript{hal} <> standard\textsubscript{id}\textsubscript{new}\textsubscript{unchecked}\textsubscript{out}\textsubscript{of}\textsubscript{range} & 282.1 ± 27.9 & 305.0 ± 17.3 & 1.08 ± 0.12\\
rust\textsubscript{cmd}\textsubscript{lib} <> test\textsubscript{proc}\textsubscript{var}\textsubscript{map} & 295.8 ± 44.0 & 807.8 ± 48.5 & 2.73 ± 0.44\\
rust\textsubscript{cmd}\textsubscript{lib} <> test\textsubscript{proc}\textsubscript{var}\textsubscript{u32} & 285.2 ± 41.7 & 805.4 ± 36.2 & 2.82 ± 0.43\\
rust\textsubscript{cmd}\textsubscript{lib} <> test\textsubscript{proc}\textsubscript{var}\textsubscript{vec} & 303.4 ± 40.6 & 802.3 ± 21.9 & 2.64 ± 0.36\\
rust\textsubscript{ansi}\textsubscript{term} <> colour\textsubscript{deserialization} & 189.3 ± 19.8 & 487.0 ± 11.3 & 2.57 ± 0.28\\
rust\textsubscript{ansi}\textsubscript{term} <> style\textsubscript{serialization} & 278.0 ± 40.8 & 486.7 ± 15.0 & 1.75 ± 0.26\\
rust\textsubscript{ansi}\textsubscript{term} <> colour\textsubscript{serialization} & 191.8 ± 16.0 & 483.7 ± 14.1 & 2.52 ± 0.22\\
\end{tabular}
\end{center}

\subsection{Modify function}
\label{sec:orgca17c7f}

\begin{center}
\begin{tabular}{llll}
Project <> Test & Warp & Cargo & \\
 & Mean [ms] & Mean [ms] & Ratio\\
\hline
cargo <> over\textsubscript{the}\textsubscript{limit} & 124.7 ± 4.1 & 9308.6 ± 1141.4 & 74.66 ± 9.48\\
cargo <> under\textsubscript{the}\textsubscript{limit} & 231.1 ± 60.7 & 8594.8 ± 616.0 & 37.19 ± 10.12\\
embedded\textsubscript{hal} <> cmp\textsubscript{id} & 259.4 ± 3.6 & 528.6 ± 99.4 & 2.04 ± 0.38\\
embedded\textsubscript{hal} <> extended\textsubscript{id}\textsubscript{new}\textsubscript{out}\textsubscript{of}\textsubscript{range} & 257.0 ± 5.0 & 520.9 ± 101.5 & 2.03 ± 0.40\\
embedded\textsubscript{hal} <> extended\textsubscript{id}\textsubscript{new}\textsubscript{unchecked}\textsubscript{out}\textsubscript{of}\textsubscript{range} & 258.3 ± 3.8 & 387.3 ± 83.1 & 1.50 ± 0.32\\
embedded\textsubscript{hal} <> get\textsubscript{standard}\textsubscript{id}\textsubscript{from}\textsubscript{extended}\textsubscript{id} & 261.8 ± 4.5 & 518.2 ± 88.0 & 1.98 ± 0.34\\
embedded\textsubscript{hal} <> standard\textsubscript{id}\textsubscript{new}\textsubscript{out}\textsubscript{of}\textsubscript{range} & 467.7 ± 11.7 & 1127.5 ± 373.8 & 2.41 ± 0.80\\
embedded\textsubscript{hal} <> standard\textsubscript{id}\textsubscript{new}\textsubscript{unchecked}\textsubscript{out}\textsubscript{of}\textsubscript{range} & 472.4 ± 11.0 & 533.3 ± 115.2 & 1.13 ± 0.25\\
rust\textsubscript{cmd}\textsubscript{lib} <> test\textsubscript{proc}\textsubscript{var}\textsubscript{map} & 207.3 ± 12.0 & 1720.3 ± 224.7 & 8.30 ± 1.19\\
rust\textsubscript{cmd}\textsubscript{lib} <> test\textsubscript{proc}\textsubscript{var}\textsubscript{u32} & 331.0 ± 19.5 & 1698.3 ± 220.0 & 5.13 ± 0.73\\
rust\textsubscript{cmd}\textsubscript{lib} <> test\textsubscript{proc}\textsubscript{var}\textsubscript{vec} & 203.9 ± 19.5 & 1083.8 ± 148.4 & 5.31 ± 0.89\\
rust\textsubscript{ansi}\textsubscript{term} <> colour\textsubscript{deserialization} & 456.2 ± 4.1 & 1634.7 ± 413.0 & 3.58 ± 0.91\\
rust\textsubscript{ansi}\textsubscript{term} <> style\textsubscript{serialization} & 456.5 ± 4.8 & 1588.3 ± 394.3 & 3.48 ± 0.86\\
rust\textsubscript{ansi}\textsubscript{term} <> colour\textsubscript{serialization} & 458.5 ± 4.3 & 1539.8 ± 301.5 & 3.36 ± 0.66\\
\end{tabular}
\end{center}

\subsection{New function}
\label{sec:orgbb17098}

\begin{center}
\begin{tabular}{llll}
Project <> Test & Warp & Cargo & \\
 & Mean [ms] & Mean [ms] & Ratio\\
\hline
cargo <> over\textsubscript{the}\textsubscript{limit} & 187.5 ± 6.0 & 8050.0 ± 311.0 & 42.94 ± 2.15\\
cargo <> under\textsubscript{the}\textsubscript{limit} & 211.9 ± 6.0 & 8042.9 ± 267.3 & 37.95 ± 1.65\\
embedded\textsubscript{hal} <> cmp\textsubscript{id} & 468.9 ± 8.4 & 368.6 ± 70.3 & 0.78 ± 0.24\\
embedded\textsubscript{hal} <> extended\textsubscript{id}\textsubscript{new}\textsubscript{out}\textsubscript{of}\textsubscript{range} & 463.8 ± 11.7 & 388.0 ± 84.1 & 0.83 ± 0.26\\
embedded\textsubscript{hal} <> extended\textsubscript{id}\textsubscript{new}\textsubscript{unchecked}\textsubscript{out}\textsubscript{of}\textsubscript{range} & 465.9 ± 6.1 & 388.7 ± 88.7 & 0.83 ± 0.27\\
embedded\textsubscript{hal} <> get\textsubscript{standard}\textsubscript{id}\textsubscript{from}\textsubscript{extended}\textsubscript{id} & 466.0 ± 5.8 & 375.5 ± 70.6 & 0.80 ± 0.23\\
embedded\textsubscript{hal} <> standard\textsubscript{id}\textsubscript{new}\textsubscript{out}\textsubscript{of}\textsubscript{range} & 465.4 ± 5.3 & 372.9 ± 68.9 & 0.80 ± 0.23\\
embedded\textsubscript{hal} <> standard\textsubscript{id}\textsubscript{new}\textsubscript{unchecked}\textsubscript{out}\textsubscript{of}\textsubscript{range} & 468.9 ± 6.9 & 393.0 ± 76.5 & 0.84 ± 0.23\\
rust\textsubscript{cmd}\textsubscript{lib} <> test\textsubscript{proc}\textsubscript{var}\textsubscript{map} & 338.2 ± 6.6 & 938.2 ± 111.3 & 2.77 ± 0.33\\
rust\textsubscript{cmd}\textsubscript{lib} <> test\textsubscript{proc}\textsubscript{var}\textsubscript{u32} & 550.7 ± 8.1 & 934.0 ± 124.5 & 1.70 ± 0.23\\
rust\textsubscript{cmd}\textsubscript{lib} <> test\textsubscript{proc}\textsubscript{var}\textsubscript{vec} & 333.0 ± 5.7 & 933.5 ± 122.7 & 2.80 ± 0.37\\
rust\textsubscript{ansi}\textsubscript{term} <> colour\textsubscript{deserialization} & 462.1 ± 7.9 & 517.4 ± 50.4 & 1.12 ± 0.11\\
rust\textsubscript{ansi}\textsubscript{term} <> style\textsubscript{serialization} & 462.0 ± 6.8 & 515.6 ± 45.7 & 1.12 ± 0.10\\
rust\textsubscript{ansi}\textsubscript{term} <> colour\textsubscript{serialization} & 459.9 ± 7.8 & 518.4 ± 42.4 & 1.13 ± 0.09\\
\end{tabular}
\end{center}
\end{document}